     A*   ************************************************************
     A*   *                                                          *
     A*   *   PGM ID ： RAN331D                  --- FMT DDS ---   *
     A*   *  作成日　： 03.03.03.                                  *
     A*   *  作成者　： H.KOJIMA.                                  *
     A*   *  業務名　：　嵐山加工センター                          *
     A*   *  処理名　：　取引先マスタ登録                          *
     A*   *                                                          *
     A*   ************************************************************
     A*   *<修正履歴>*                                             *
     A*   *     XXXX.XX.XX. XXXXXXXX                                 *
     A*   ************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CHGINPDFT
     A*****************************************************************
     A* Ａ画面
     A*****************************************************************
     A          R RAN331DA
     A                                      KEEP
     A                                      CA02(02)
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A  90                                  ALARM
     A  90                                  OVERLAY
     A  90                                  PUTRETAIN
     A                                      SETOF(90)
     A*
     A            WDATE         78A  O  1  2DSPATR(UL)
     A                                  4 12'＊＊＊＊＊＊＊＊＊＊＊＊+
     A                                       ＊＊＊＊＊＊＊＊＊＊＊＊+
     A                                       ＊＊＊＊'
     A                                  5 12'＊'
     A                                  5 66'＊'
     A                                  6 12'＊'
     A            WNAME         36O  O  6 23 DSPATR(HI)
     A                                  6 66'＊'
     A                                  7 12'＊'
     A                                  7 66'＊'
     A                                  8 12'＊＊＊＊＊＊＊＊＊＊＊＊+
     A                                       ＊＊＊＊＊＊＊＊＊＊＊＊+
     A                                       ＊＊＊＊'
     A*
     A*得意先(91)
     A  91                             12 25'  得意先  '    DSPATR(RI)
     A  91        DTOKC1         6   B 12 41 DSPATR(UL CS)
     A*届先  (92)
     A  92                             12 25'  得意先  '    DSPATR(RI)
     A  92        DTOKC2         6   B 12 41 DSPATR(UL CS)
     A  92                             14 25'  届　先  '    DSPATR(RI)
     A  92        DTODC2         4Y 0B 14 41 DSPATR(UL CS)  EDTCDE(4)
     A*業者  (93)
     A  93                             12 25'  区　分  '    DSPATR(RI)
     A  93        DKBN           1   B 12 41 DSPATR(UL CS)
     A  93                             12 45'1.デポ 2.倉庫 3.運送会社'
     A  93                             13 45'4.外注          5.梱包会社'
     A  93                             15 25'  コード  '    DSPATR(RI)
     A  93        DTOKC3         6   B 15 41 DSPATR(UL CS)
     A*
     A*PFｷ-
     A                                 24  3'PF2 ﾒﾆｭｰ'
     A                                 24 15'PF5得意先'
     A                                 24 28'PF6届先'
     A                                 24 39'PF7業者'
     A                                 24 60'実行：次画面'
     A  90        MSG           70   M
     A*****************************************************************
     A* Ｂ画面
     A*****************************************************************
     A          R RAN331DB
     A                                      KEEP
     A                                      CA03
     A  90                                  ALARM
     A  90                                  OVERLAY
     A  90                                  PUTRETAIN
     A                                      SETOF(90)
     A*
     A            WDATE         78A  O  1  2DSPATR(UL)
     A                                  4 12'＊＊＊＊＊＊＊＊＊＊＊＊+
     A                                       ＊＊＊＊＊＊＊＊＊＊＊＊+
     A                                       ＊＊＊＊'
     A                                  5 12'＊'
     A                                  5 66'＊'
     A                                  6 12'＊'
     A            WNAME         36O  O  6 23 DSPATR(HI)
     A                                  6 66'＊'
     A                                  7 12'＊'
     A                                  7 66'＊'
     A                                  8 12'＊＊＊＊＊＊＊＊＊＊＊＊+
     A                                       ＊＊＊＊＊＊＊＊＊＊＊＊+
     A                                       ＊＊＊＊'
     A*
     A*得意先(91)
     A  91                             12 25'  得意先  '    DSPATR(RI)
     A  91        DTOKC1         6   O 12 41
     A  91        DTOKM1        20   O 12 48
     A*届先  (92)
     A  92                             12 25'  得意先  '    DSPATR(RI)
     A  92        DTOKC2         6   O 12 41
     A  92        DTOKM2        20   O 12 48
     A  92                             14 25'  届　先  '    DSPATR(RI)
     A  92        DTODC2         4Y 0O 14 41 EDTCDE(4)
     A  92        DTODM2        20   O 14 48
     A*業者  (93)
     A  93                             12 25'  区　分  '    DSPATR(RI)
     A  93        DKBN           1   O 12 41
     A  93                             12 45'1.デポ 2.倉庫 3.運送会社'
     A  93                             13 45'4.外注          5.梱包会社'
     A  93                             15 25'  コード  '    DSPATR(RI)
     A  93        DTOKC3         6   O 15 41
     A  93        DTOKM3        20   O 15 48
     A*
     A                                 22 65'確認'     DSPATR(RI)
     A            WKANMK         1A  B 22 72           DSPATR(CS PC)
     A                                 22 74'1完了'
     A*PFｷ-
     A                                 24  3'PF3前画面'
     A                                 24 60'実行：次画面'
     A  90        MSG           70   M
